---
type: AssemblyDifferenceNamingCategory
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# AssemblyDifferenceNamingCategory

`Autodesk.Revit.DB.AssemblyDifferenceNamingCategory` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | NamingCategoryId1 | 2012 | `public ElementId NamingCategoryId1 { get ; }` |
| Property | NamingCategoryId2 | 2012 | `public ElementId NamingCategoryId2 { get ; }` |